src/Reports/ОтчетОПрохожденииПрививок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОПрохожденииПрививок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПрививок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчетаЗавершения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд1Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд2Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд3Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд4Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд5Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд6Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1ВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1ВВалютеЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетВОтражение</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомГруппаВОтражение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеВОтражение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаИзмерение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользуетсяВНаряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ОтчетОПрохожденииПрививок/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Функция СформироватьЗапросПоБолееПозднейДате(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛицаПрививки.Ссылка,
	|	ФизическиеЛицаПрививки.НомерСтроки,
	|	ФизическиеЛицаПрививки.ДатаПрививки КАК ДатаПрививки,
	|	ФизическиеЛицаПрививки.НаименованиеПрививки,
	|	ФизическиеЛицаПрививки.СерияПрививки,
	|	ФизическиеЛицаПрививки.ПоликлиникаПрививки,
	|	ФизическиеЛицаПрививки.ДозаПрививки
	|ИЗ
	|	Справочник.ФизическиеЛица.Прививки КАК ФизическиеЛицаПрививки
	|ГДЕ
	|	ФизическиеЛицаПрививки.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПрививки УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", НачПериод);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции

Функция СформироватьЗапросПоРаботникамВДекрете(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.Период <= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения >= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("РабочаяДата", РабочаяДата);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции


	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокФлюрографии, ДокументРезультат)
	
	Пока ВыборкаСтрокФлюрографии.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокФлюрографии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		РезультаВыбораДекретниц = СформироватьЗапросПоРаботникамВДекрете(ВыборкаСтрокФлюрографии.Сотрудник).Выбрать();
		Если Не РезультаВыбораДекретниц.Следующий() Тогда
			Если Не БезПрививок Тогда
				
				Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда	
					
					мНомер = 0;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
					ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
					ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
					ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					мНомер = мНомер + 1;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
					ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
					ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
					ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
					ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
					ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаПрививки;
					ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = ВыборкаСтрокФлюрографии.НаименованиеПрививки;
					ОбластьДетальныхЗаписей.Параметры.Серия = ВыборкаСтрокФлюрографии.СерияПрививки;
					ОбластьДетальныхЗаписей.Параметры.Поликлиника = ВыборкаСтрокФлюрографии.ПоликлиникаПрививки;
					ОбластьДетальныхЗаписей.Параметры.Доза = ВыборкаСтрокФлюрографии.ДозаПрививки;
					
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				Иначе
					мНомер = мНомер + 1;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
					ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
					ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
					ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
					ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
					ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаПрививки;
					ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = ВыборкаСтрокФлюрографии.НаименованиеПрививки;
					ОбластьДетальныхЗаписей.Параметры.Серия = ВыборкаСтрокФлюрографии.СерияПрививки;
					ОбластьДетальныхЗаписей.Параметры.Поликлиника = ВыборкаСтрокФлюрографии.ПоликлиникаПрививки;
					ОбластьДетальныхЗаписей.Параметры.Доза = ВыборкаСтрокФлюрографии.ДозаПрививки;
					
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				КонецЕсли;
			Иначе
				Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда	
					РезультатВыбора = СформироватьЗапросПоБолееПозднейДате(ВыборкаСтрокФлюрографии.Сотрудник.ФизЛицо).Выбрать();
					Если РезультатВыбора.Следующий() Тогда
						Если РезультатВыбора.ДатаПрививки < НачПериод Тогда
							мНомер = 0;
							ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
							ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
							ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
							ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
							ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
							
							мНомер = мНомер + 1;
							ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
							ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
							ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
							ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
							ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
							ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаПрививки;
							ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = РезультатВыбора.НаименованиеПрививки;
							ОбластьДетальныхЗаписей.Параметры.Серия = РезультатВыбора.СерияПрививки;
							ОбластьДетальныхЗаписей.Параметры.Поликлиника = РезультатВыбора.ПоликлиникаПрививки;
							ОбластьДетальныхЗаписей.Параметры.Доза = РезультатВыбора.ДозаПрививки;
							
							ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);						
						КонецЕсли;
					Иначе
						мНомер = 0;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
						ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
						ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
						ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
						
						мНомер = мНомер + 1;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
						ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
						ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
						ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
						ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = "";
						ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = "";
						ОбластьДетальныхЗаписей.Параметры.Серия = "";
						ОбластьДетальныхЗаписей.Параметры.Поликлиника = "";
						ОбластьДетальныхЗаписей.Параметры.Доза = "";
						
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					КонецЕсли;
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				Иначе
					РезультатВыбора = СформироватьЗапросПоБолееПозднейДате(ВыборкаСтрокФлюрографии.Сотрудник.ФизЛицо).Выбрать();
					Если РезультатВыбора.Следующий() Тогда
						Если РезультатВыбора.ДатаПрививки < НачПериод Тогда
							
							мНомер = мНомер + 1;
							ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
							ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
							ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
							ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
							ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
							ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаПрививки;
							ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = РезультатВыбора.НаименованиеПрививки;
							ОбластьДетальныхЗаписей.Параметры.Серия = РезультатВыбора.СерияПрививки;
							ОбластьДетальныхЗаписей.Параметры.Поликлиника = РезультатВыбора.ПоликлиникаПрививки;
							ОбластьДетальныхЗаписей.Параметры.Доза = РезультатВыбора.ДозаПрививки;
							
							ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);						
						КонецЕсли;
					Иначе
						
						мНомер = мНомер + 1;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
						ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
						ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
						ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
						ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = "";
						ОбластьДетальныхЗаписей.Параметры.НаименованиеПривики = "";
						ОбластьДетальныхЗаписей.Параметры.Серия = "";
						ОбластьДетальныхЗаписей.Параметры.Поликлиника = "";
						ОбластьДетальныхЗаписей.Параметры.Доза = "";
						
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					КонецЕсли;
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	ТекПодр = ""; 
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,	
	|	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	|	//1 ФизическиеЛицаПрививки.ДатаПрививки,
	|	//2 ФизическиеЛицаПрививки.НаименованиеПрививки,
	|	//3 ФизическиеЛицаПрививки.СерияПрививки,
	|	//4 ФизическиеЛицаПрививки.ПоликлиникаПрививки,
	|	//5 ФизическиеЛицаПрививки.ДозаПрививки
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Прививки КАК ФизическиеЛицаПрививки
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаПрививки.Ссылка
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	|	//И ФизическиеЛицаПрививки.ДатаПрививки >= &ДатаНачала
	|	//И ФизическиеЛицаПрививки.ДатаПрививки <= &ДатаОкончания	
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	//ФизическиеЛицаПрививки.ДатаПрививки,
	|	//ФизическиеЛицаПрививки.НаименованиеПрививки,
	|	//ФизическиеЛицаПрививки.СерияПрививки,
	|	//ФизическиеЛицаПрививки.ПоликлиникаПрививки,
	|	//ФизическиеЛицаПрививки.ДозаПрививки
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииПриоритет Возр,
	|	СотрудникНаименование Возр,
	|	Должность";

	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("ДатаОтчета",РабочаяДата);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	
	Если Не БезПрививок тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 ФизическиеЛицаПрививки.ДатаПрививки,","ФизическиеЛицаПрививки.ДатаПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//2 ФизическиеЛицаПрививки.НаименованиеПрививки,","ФизическиеЛицаПрививки.НаименованиеПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//3 ФизическиеЛицаПрививки.СерияПрививки,","ФизическиеЛицаПрививки.СерияПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//4 ФизическиеЛицаПрививки.ПоликлиникаПрививки,","ФизическиеЛицаПрививки.ПоликлиникаПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//5 ФизическиеЛицаПрививки.ДозаПрививки","ФизическиеЛицаПрививки.ДозаПрививки");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаПрививки.ДатаПрививки >= &ДатаНачала","И ФизическиеЛицаПрививки.ДатаПрививки >= &ДатаНачала");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаПрививки.ДатаПрививки <= &ДатаОкончания","И ФизическиеЛицаПрививки.ДатаПрививки <= &ДатаОкончания");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаПрививки.ДатаПрививки,","ФизическиеЛицаПрививки.ДатаПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаПрививки.НаименованиеПрививки,","ФизическиеЛицаПрививки.НаименованиеПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаПрививки.СерияПрививки,","ФизическиеЛицаПрививки.СерияПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаПрививки.ПоликлиникаПрививки,","ФизическиеЛицаПрививки.ПоликлиникаПрививки,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаПрививки.ДозаПрививки","ФизическиеЛицаПрививки.ДозаПрививки");		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность КАК Должность,","РаботникиОрганизацийСрезПоследних.Должность КАК Должность");
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаПрививки.ДатаПрививки >= &ДатаНачала","И (ФизическиеЛицаПрививки.ДатаПрививки < &ДатаНачала ИЛИ ФизическиеЛицаПрививки.ДатаПрививки ЕСТЬ NULL)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность,","РаботникиОрганизацийСрезПоследних.Должность");
	КонецЕсли;

	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	Область.Параметры.Подразделение = ?(ЗначениеЗаполнено(Подразделение), СокрЛП(Подразделение.Наименование), "");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетПрививки");
#КонецЕсли
